// компонент - це незалежний елемент інтерфейсу, який можна налаштовувати
// він зберігає в собі шаблон розмітки і приймає дані, які потрібно поставити в цей шаблон
// компонентом може бути все, що завгодно (логотип, хедер, сайдбар, частина сайдбару, меню
// юзерпрофайл, галерея, елемент галереї)

//дефолтні картинки кладемо собі в проект, імпортуємо
//і ставимо як дефолтні значення в деструктуризації
// оголосити свої дефолтні значення є обов'язком самого компоненту
import defaultImage from "./default.jpg";

// всередині самго файлу компоненту ми оголошуємо сам компонент, його пропси
// а отримувати пропси він буде там, де він буде рендеритись
export default function Painting(props) {
  // оскільки props - це об'єкт, його можна деструктуризувати
  // можна в тілі функції, або в самому підписі функції
  const { imageUrl = defaultImage, author = "unknown", title, price } = props;
  //   console.log(props);
  return (
    <div>
      <img src={imageUrl} alt={title} width="480" />
      <h2>{title}</h2>
      <p>Author: {author}</p>
      <p>Price: {price} uah</p>
      <p>Availability</p>
      <button>Add to cart</button>
    </div>
  );
}
